HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxMinimcds_reg.h
/**
 * \file IfxMinimcds_reg.h
 * \brief
 * \copyright Copyright (c) 2014 Infineon Technologies AG. All rights reserved.
 *
 * Version: TC29X_UM_V1.1.R1
 * Specification: tc29x_um_v1.1p4_SFR_OPEN_MARKET.xml (Revision: UM_V1.1)
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Minimcds_Cfg Minimcds address
 * \ingroup IfxLld_Minimcds
 * 
 * \defgroup IfxLld_Minimcds_Cfg_BaseAddress Base address
 * \ingroup IfxLld_Minimcds_Cfg
 * 
 * \defgroup IfxLld_Minimcds_Cfg_Minimcds 2-MINIMCDS
 * \ingroup IfxLld_Minimcds_Cfg
 * 
 */
#ifndef IFXMINIMCDS_REG_H
#define IFXMINIMCDS_REG_H 1
/******************************************************************************/
#include "IfxMinimcds_regdef.h"
/******************************************************************************/
/** \addtogroup IfxLld_Minimcds_Cfg_BaseAddress
 * \{  */

/** \\brief  MINIMCDS object */
#define MODULE_MINIMCDS /*lint --e(923)*/ ((*(Ifx_MINIMCDS*)0xF9100000u))
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Minimcds_Cfg_Minimcds
 * \{  */

/** \\brief  0, Clock Control Register */
#define MINIMCDS_CLC /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_CLC*)0xF9100000u)

/** \\brief  10, MCDS Control Register */
#define MINIMCDS_CT /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_CT*)0xF9100010u)

/** \\brief  204, Trace Buffer Bottom Register */
#define MINIMCDS_FIFOBOT /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_FIFOBOT*)0xF9100204u)

/** \\brief  210, Trace Buffer Control Register */
#define MINIMCDS_FIFOCTL /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_FIFOCTL*)0xF9100210u)

/** \\brief  200, Trace Buffer Write Pointer */
#define MINIMCDS_FIFONOW /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_FIFONOW*)0xF9100200u)

/** \\brief  208, Trace Buffer PRE/POST Register */
#define MINIMCDS_FIFOPRE /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_FIFOPRE*)0xF9100208u)

/** \\brief  20C, Trace Buffer Top Register */
#define MINIMCDS_FIFOTOP /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_FIFOTOP*)0xF910020Cu)

/** \\brief  214, Trace Buffer Comparator Register */
#define MINIMCDS_FIFOWARN0 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_FIFOWARN0*)0xF9100214u)

/** \\brief  218, Trace Buffer Comparator Register */
#define MINIMCDS_FIFOWARN1 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_FIFOWARN1*)0xF9100218u)

/** \\brief  8, Module Identification Register */
#define MINIMCDS_ID /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ID*)0xF9100008u)

/** \\brief  880, Action Definition Register */
#define MINIMCDS_MCX_ACT0 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF9100880u)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT0.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT0.
*/
#define	MINIMCDS_MCXACT0	(MINIMCDS_MCX_ACT0)

/** \\brief  884, Action Definition Register */
#define MINIMCDS_MCX_ACT1 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF9100884u)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT1.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT1.
*/
#define	MINIMCDS_MCXACT1	(MINIMCDS_MCX_ACT1)

/** \\brief  8A8, Action Definition Register */
#define MINIMCDS_MCX_ACT10 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF91008A8u)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT10.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT10.
*/
#define	MINIMCDS_MCXACT10	(MINIMCDS_MCX_ACT10)

/** \\brief  8AC, Action Definition Register */
#define MINIMCDS_MCX_ACT11 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF91008ACu)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT11.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT11.
*/
#define	MINIMCDS_MCXACT11	(MINIMCDS_MCX_ACT11)

/** \\brief  8B0, Action Definition Register */
#define MINIMCDS_MCX_ACT12 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF91008B0u)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT12.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT12.
*/
#define	MINIMCDS_MCXACT12	(MINIMCDS_MCX_ACT12)

/** \\brief  8B4, Action Definition Register */
#define MINIMCDS_MCX_ACT13 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF91008B4u)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT13.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT13.
*/
#define	MINIMCDS_MCXACT13	(MINIMCDS_MCX_ACT13)

/** \\brief  8B8, Action Definition Register */
#define MINIMCDS_MCX_ACT14 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF91008B8u)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT14.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT14.
*/
#define	MINIMCDS_MCXACT14	(MINIMCDS_MCX_ACT14)

/** \\brief  8BC, Action Definition Register */
#define MINIMCDS_MCX_ACT15 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF91008BCu)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT15.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT15.
*/
#define	MINIMCDS_MCXACT15	(MINIMCDS_MCX_ACT15)

/** \\brief  8C0, Action Definition Register */
#define MINIMCDS_MCX_ACT16 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF91008C0u)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT16.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT16.
*/
#define	MINIMCDS_MCXACT16	(MINIMCDS_MCX_ACT16)

/** \\brief  8C4, Action Definition Register */
#define MINIMCDS_MCX_ACT17 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF91008C4u)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT17.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT17.
*/
#define	MINIMCDS_MCXACT17	(MINIMCDS_MCX_ACT17)

