HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxMinimcds_reg.h
/** \\brief  8C8, Action Definition Register */
#define MINIMCDS_MCX_ACT18 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF91008C8u)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT18.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT18.
*/
#define	MINIMCDS_MCXACT18	(MINIMCDS_MCX_ACT18)

/** \\brief  8CC, Action Definition Register */
#define MINIMCDS_MCX_ACT19 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF91008CCu)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT19.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT19.
*/
#define	MINIMCDS_MCXACT19	(MINIMCDS_MCX_ACT19)

/** \\brief  888, Action Definition Register */
#define MINIMCDS_MCX_ACT2 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF9100888u)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT2.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT2.
*/
#define	MINIMCDS_MCXACT2	(MINIMCDS_MCX_ACT2)

/** \\brief  8D0, Action Definition Register */
#define MINIMCDS_MCX_ACT20 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF91008D0u)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT20.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT20.
*/
#define	MINIMCDS_MCXACT20	(MINIMCDS_MCX_ACT20)

/** \\brief  8D4, Action Definition Register */
#define MINIMCDS_MCX_ACT21 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF91008D4u)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT21.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT21.
*/
#define	MINIMCDS_MCXACT21	(MINIMCDS_MCX_ACT21)

/** \\brief  8D8, Action Definition Register */
#define MINIMCDS_MCX_ACT22 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF91008D8u)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT22.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT22.
*/
#define	MINIMCDS_MCXACT22	(MINIMCDS_MCX_ACT22)

/** \\brief  8DC, Action Definition Register */
#define MINIMCDS_MCX_ACT23 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF91008DCu)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT23.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT23.
*/
#define	MINIMCDS_MCXACT23	(MINIMCDS_MCX_ACT23)

/** \\brief  8E0, Action Definition Register */
#define MINIMCDS_MCX_ACT24 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF91008E0u)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT24.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT24.
*/
#define	MINIMCDS_MCXACT24	(MINIMCDS_MCX_ACT24)

/** \\brief  8E4, Action Definition Register */
#define MINIMCDS_MCX_ACT25 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF91008E4u)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT25.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT25.
*/
#define	MINIMCDS_MCXACT25	(MINIMCDS_MCX_ACT25)

/** \\brief  8E8, Action Definition Register */
#define MINIMCDS_MCX_ACT26 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF91008E8u)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT26.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT26.
*/
#define	MINIMCDS_MCXACT26	(MINIMCDS_MCX_ACT26)

/** \\brief  8EC, Action Definition Register */
#define MINIMCDS_MCX_ACT27 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF91008ECu)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT27.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT27.
*/
#define	MINIMCDS_MCXACT27	(MINIMCDS_MCX_ACT27)

/** \\brief  8F0, Action Definition Register */
#define MINIMCDS_MCX_ACT28 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF91008F0u)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT28.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT28.
*/
#define	MINIMCDS_MCXACT28	(MINIMCDS_MCX_ACT28)

/** \\brief  8F4, Action Definition Register */
#define MINIMCDS_MCX_ACT29 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF91008F4u)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT29.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT29.
*/
#define	MINIMCDS_MCXACT29	(MINIMCDS_MCX_ACT29)

/** \\brief  88C, Action Definition Register */
#define MINIMCDS_MCX_ACT3 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF910088Cu)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT3.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT3.
*/
#define	MINIMCDS_MCXACT3	(MINIMCDS_MCX_ACT3)

/** \\brief  8F8, Action Definition Register */
#define MINIMCDS_MCX_ACT30 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF91008F8u)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT30.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT30.
*/
#define	MINIMCDS_MCXACT30	(MINIMCDS_MCX_ACT30)

/** \\brief  8FC, Action Definition Register */
#define MINIMCDS_MCX_ACT31 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF91008FCu)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT31.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT31.
*/
#define	MINIMCDS_MCXACT31	(MINIMCDS_MCX_ACT31)

/** \\brief  900, Action Definition Register */
#define MINIMCDS_MCX_ACT32 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF9100900u)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT32.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT32.
*/
#define	MINIMCDS_MCXACT32	(MINIMCDS_MCX_ACT32)

/** \\brief  904, Action Definition Register */
#define MINIMCDS_MCX_ACT33 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF9100904u)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT33.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT33.
*/
#define	MINIMCDS_MCXACT33	(MINIMCDS_MCX_ACT33)

/** \\brief  908, Action Definition Register */
#define MINIMCDS_MCX_ACT34 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF9100908u)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT34.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT34.
*/
#define	MINIMCDS_MCXACT34	(MINIMCDS_MCX_ACT34)

/** \\brief  90C, Action Definition Register */
#define MINIMCDS_MCX_ACT35 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF910090Cu)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT35.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT35.
*/
#define	MINIMCDS_MCXACT35	(MINIMCDS_MCX_ACT35)

/** \\brief  910, Action Definition Register */
#define MINIMCDS_MCX_ACT36 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF9100910u)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT36.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT36.
*/
#define	MINIMCDS_MCXACT36	(MINIMCDS_MCX_ACT36)

/** \\brief  914, Action Definition Register */
#define MINIMCDS_MCX_ACT37 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF9100914u)

