HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxMinimcds_reg.h
/** Alias (User Manual Name) for MINIMCDS_MCX_ACT37.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT37.
*/
#define	MINIMCDS_MCXACT37	(MINIMCDS_MCX_ACT37)

/** \\brief  918, Action Definition Register */
#define MINIMCDS_MCX_ACT38 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF9100918u)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT38.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT38.
*/
#define	MINIMCDS_MCXACT38	(MINIMCDS_MCX_ACT38)

/** \\brief  91C, Action Definition Register */
#define MINIMCDS_MCX_ACT39 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF910091Cu)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT39.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT39.
*/
#define	MINIMCDS_MCXACT39	(MINIMCDS_MCX_ACT39)

/** \\brief  890, Action Definition Register */
#define MINIMCDS_MCX_ACT4 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF9100890u)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT4.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT4.
*/
#define	MINIMCDS_MCXACT4	(MINIMCDS_MCX_ACT4)

/** \\brief  920, Action Definition Register */
#define MINIMCDS_MCX_ACT40 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF9100920u)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT40.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT40.
*/
#define	MINIMCDS_MCXACT40	(MINIMCDS_MCX_ACT40)

/** \\brief  894, Action Definition Register */
#define MINIMCDS_MCX_ACT5 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF9100894u)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT5.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT5.
*/
#define	MINIMCDS_MCXACT5	(MINIMCDS_MCX_ACT5)

/** \\brief  898, Action Definition Register */
#define MINIMCDS_MCX_ACT6 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF9100898u)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT6.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT6.
*/
#define	MINIMCDS_MCXACT6	(MINIMCDS_MCX_ACT6)

/** \\brief  89C, Action Definition Register */
#define MINIMCDS_MCX_ACT7 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF910089Cu)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT7.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT7.
*/
#define	MINIMCDS_MCXACT7	(MINIMCDS_MCX_ACT7)

/** \\brief  8A0, Action Definition Register */
#define MINIMCDS_MCX_ACT8 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF91008A0u)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT8.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT8.
*/
#define	MINIMCDS_MCXACT8	(MINIMCDS_MCX_ACT8)

/** \\brief  8A4, Action Definition Register */
#define MINIMCDS_MCX_ACT9 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_ACT*)0xF91008A4u)

/** Alias (User Manual Name) for MINIMCDS_MCX_ACT9.
* To use register names with standard convension, please use MINIMCDS_MCX_ACT9.
*/
#define	MINIMCDS_MCXACT9	(MINIMCDS_MCX_ACT9)

/** \\brief  A00, Counter Control Register */
#define MINIMCDS_MCX_CNT0_CCL /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_CNT_CCL*)0xF9100A00u)

/** Alias (User Manual Name) for MINIMCDS_MCX_CNT0_CCL.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT0_CCL.
*/
#define	MINIMCDS_MCXCCL0	(MINIMCDS_MCX_CNT0_CCL)

/** \\brief  A08, Current Count Register */
#define MINIMCDS_MCX_CNT0_CNT /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_CNT_CNT*)0xF9100A08u)

/** Alias (User Manual Name) for MINIMCDS_MCX_CNT0_CNT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT0_CNT.
*/
#define	MINIMCDS_MCXCNT0	(MINIMCDS_MCX_CNT0_CNT)

/** \\brief  A04, Counter Limit Register */
#define MINIMCDS_MCX_CNT0_LMT /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_CNT_LMT*)0xF9100A04u)

/** Alias (User Manual Name) for MINIMCDS_MCX_CNT0_LMT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT0_LMT.
*/
#define	MINIMCDS_MCXLMT0	(MINIMCDS_MCX_CNT0_LMT)

/** \\brief  A10, Counter Control Register */
#define MINIMCDS_MCX_CNT1_CCL /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_CNT_CCL*)0xF9100A10u)

/** Alias (User Manual Name) for MINIMCDS_MCX_CNT1_CCL.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT1_CCL.
*/
#define	MINIMCDS_MCXCCL1	(MINIMCDS_MCX_CNT1_CCL)

/** \\brief  A18, Current Count Register */
#define MINIMCDS_MCX_CNT1_CNT /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_CNT_CNT*)0xF9100A18u)

/** Alias (User Manual Name) for MINIMCDS_MCX_CNT1_CNT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT1_CNT.
*/
#define	MINIMCDS_MCXCNT1	(MINIMCDS_MCX_CNT1_CNT)

/** \\brief  A14, Counter Limit Register */
#define MINIMCDS_MCX_CNT1_LMT /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_CNT_LMT*)0xF9100A14u)

/** Alias (User Manual Name) for MINIMCDS_MCX_CNT1_LMT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT1_LMT.
*/
#define	MINIMCDS_MCXLMT1	(MINIMCDS_MCX_CNT1_LMT)

/** \\brief  A20, Counter Control Register */
#define MINIMCDS_MCX_CNT2_CCL /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_CNT_CCL*)0xF9100A20u)

/** Alias (User Manual Name) for MINIMCDS_MCX_CNT2_CCL.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT2_CCL.
*/
#define	MINIMCDS_MCXCCL2	(MINIMCDS_MCX_CNT2_CCL)

/** \\brief  A28, Current Count Register */
#define MINIMCDS_MCX_CNT2_CNT /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_CNT_CNT*)0xF9100A28u)

/** Alias (User Manual Name) for MINIMCDS_MCX_CNT2_CNT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT2_CNT.
*/
#define	MINIMCDS_MCXCNT2	(MINIMCDS_MCX_CNT2_CNT)

/** \\brief  A24, Counter Limit Register */
#define MINIMCDS_MCX_CNT2_LMT /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_CNT_LMT*)0xF9100A24u)

/** Alias (User Manual Name) for MINIMCDS_MCX_CNT2_LMT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT2_LMT.
*/
#define	MINIMCDS_MCXLMT2	(MINIMCDS_MCX_CNT2_LMT)

/** \\brief  A30, Counter Control Register */
#define MINIMCDS_MCX_CNT3_CCL /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_CNT_CCL*)0xF9100A30u)

/** Alias (User Manual Name) for MINIMCDS_MCX_CNT3_CCL.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT3_CCL.
*/
#define	MINIMCDS_MCXCCL3	(MINIMCDS_MCX_CNT3_CCL)

/** \\brief  A38, Current Count Register */
#define MINIMCDS_MCX_CNT3_CNT /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_CNT_CNT*)0xF9100A38u)

/** Alias (User Manual Name) for MINIMCDS_MCX_CNT3_CNT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT3_CNT.
*/
#define	MINIMCDS_MCXCNT3	(MINIMCDS_MCX_CNT3_CNT)

/** \\brief  A34, Counter Limit Register */
#define MINIMCDS_MCX_CNT3_LMT /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_CNT_LMT*)0xF9100A34u)

