HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxMinimcds_reg.h
/** Alias (User Manual Name) for MINIMCDS_MCX_CNT3_LMT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT3_LMT.
*/
#define	MINIMCDS_MCXLMT3	(MINIMCDS_MCX_CNT3_LMT)

/** \\brief  A40, Counter Control Register */
#define MINIMCDS_MCX_CNT4_CCL /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_CNT_CCL*)0xF9100A40u)

/** Alias (User Manual Name) for MINIMCDS_MCX_CNT4_CCL.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT4_CCL.
*/
#define	MINIMCDS_MCXCCL4	(MINIMCDS_MCX_CNT4_CCL)

/** \\brief  A48, Current Count Register */
#define MINIMCDS_MCX_CNT4_CNT /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_CNT_CNT*)0xF9100A48u)

/** Alias (User Manual Name) for MINIMCDS_MCX_CNT4_CNT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT4_CNT.
*/
#define	MINIMCDS_MCXCNT4	(MINIMCDS_MCX_CNT4_CNT)

/** \\brief  A44, Counter Limit Register */
#define MINIMCDS_MCX_CNT4_LMT /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_CNT_LMT*)0xF9100A44u)

/** Alias (User Manual Name) for MINIMCDS_MCX_CNT4_LMT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT4_LMT.
*/
#define	MINIMCDS_MCXLMT4	(MINIMCDS_MCX_CNT4_LMT)

/** \\brief  A50, Counter Control Register */
#define MINIMCDS_MCX_CNT5_CCL /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_CNT_CCL*)0xF9100A50u)

/** Alias (User Manual Name) for MINIMCDS_MCX_CNT5_CCL.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT5_CCL.
*/
#define	MINIMCDS_MCXCCL5	(MINIMCDS_MCX_CNT5_CCL)

/** \\brief  A58, Current Count Register */
#define MINIMCDS_MCX_CNT5_CNT /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_CNT_CNT*)0xF9100A58u)

/** Alias (User Manual Name) for MINIMCDS_MCX_CNT5_CNT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT5_CNT.
*/
#define	MINIMCDS_MCXCNT5	(MINIMCDS_MCX_CNT5_CNT)

/** \\brief  A54, Counter Limit Register */
#define MINIMCDS_MCX_CNT5_LMT /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_CNT_LMT*)0xF9100A54u)

/** Alias (User Manual Name) for MINIMCDS_MCX_CNT5_LMT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT5_LMT.
*/
#define	MINIMCDS_MCXLMT5	(MINIMCDS_MCX_CNT5_LMT)

/** \\brief  A60, Counter Control Register */
#define MINIMCDS_MCX_CNT6_CCL /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_CNT_CCL*)0xF9100A60u)

/** Alias (User Manual Name) for MINIMCDS_MCX_CNT6_CCL.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT6_CCL.
*/
#define	MINIMCDS_MCXCCL6	(MINIMCDS_MCX_CNT6_CCL)

/** \\brief  A68, Current Count Register */
#define MINIMCDS_MCX_CNT6_CNT /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_CNT_CNT*)0xF9100A68u)

/** Alias (User Manual Name) for MINIMCDS_MCX_CNT6_CNT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT6_CNT.
*/
#define	MINIMCDS_MCXCNT6	(MINIMCDS_MCX_CNT6_CNT)

/** \\brief  A64, Counter Limit Register */
#define MINIMCDS_MCX_CNT6_LMT /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_CNT_LMT*)0xF9100A64u)

/** Alias (User Manual Name) for MINIMCDS_MCX_CNT6_LMT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT6_LMT.
*/
#define	MINIMCDS_MCXLMT6	(MINIMCDS_MCX_CNT6_LMT)

/** \\brief  A70, Counter Control Register */
#define MINIMCDS_MCX_CNT7_CCL /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_CNT_CCL*)0xF9100A70u)

/** Alias (User Manual Name) for MINIMCDS_MCX_CNT7_CCL.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT7_CCL.
*/
#define	MINIMCDS_MCXCCL7	(MINIMCDS_MCX_CNT7_CCL)

/** \\brief  A78, Current Count Register */
#define MINIMCDS_MCX_CNT7_CNT /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_CNT_CNT*)0xF9100A78u)

/** Alias (User Manual Name) for MINIMCDS_MCX_CNT7_CNT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT7_CNT.
*/
#define	MINIMCDS_MCXCNT7	(MINIMCDS_MCX_CNT7_CNT)

/** \\brief  A74, Counter Limit Register */
#define MINIMCDS_MCX_CNT7_LMT /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_CNT_LMT*)0xF9100A74u)

/** Alias (User Manual Name) for MINIMCDS_MCX_CNT7_LMT.
* To use register names with standard convension, please use MINIMCDS_MCX_CNT7_LMT.
*/
#define	MINIMCDS_MCXLMT7	(MINIMCDS_MCX_CNT7_LMT)

/** \\brief  800, Event Definition Register */
#define MINIMCDS_MCX_EVT0 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_EVT*)0xF9100800u)

/** Alias (User Manual Name) for MINIMCDS_MCX_EVT0.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT0.
*/
#define	MINIMCDS_MCXEVT0	(MINIMCDS_MCX_EVT0)

/** \\brief  804, Event Definition Register */
#define MINIMCDS_MCX_EVT1 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_EVT*)0xF9100804u)

/** Alias (User Manual Name) for MINIMCDS_MCX_EVT1.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT1.
*/
#define	MINIMCDS_MCXEVT1	(MINIMCDS_MCX_EVT1)

/** \\brief  828, Event Definition Register */
#define MINIMCDS_MCX_EVT10 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_EVT*)0xF9100828u)

/** Alias (User Manual Name) for MINIMCDS_MCX_EVT10.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT10.
*/
#define	MINIMCDS_MCXEVT10	(MINIMCDS_MCX_EVT10)

/** \\brief  82C, Event Definition Register */
#define MINIMCDS_MCX_EVT11 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_EVT*)0xF910082Cu)

/** Alias (User Manual Name) for MINIMCDS_MCX_EVT11.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT11.
*/
#define	MINIMCDS_MCXEVT11	(MINIMCDS_MCX_EVT11)

/** \\brief  830, Event Definition Register */
#define MINIMCDS_MCX_EVT12 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_EVT*)0xF9100830u)

/** Alias (User Manual Name) for MINIMCDS_MCX_EVT12.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT12.
*/
#define	MINIMCDS_MCXEVT12	(MINIMCDS_MCX_EVT12)

/** \\brief  834, Event Definition Register */
#define MINIMCDS_MCX_EVT13 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_EVT*)0xF9100834u)

/** Alias (User Manual Name) for MINIMCDS_MCX_EVT13.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT13.
*/
#define	MINIMCDS_MCXEVT13	(MINIMCDS_MCX_EVT13)

/** \\brief  838, Event Definition Register */
#define MINIMCDS_MCX_EVT14 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_EVT*)0xF9100838u)

/** Alias (User Manual Name) for MINIMCDS_MCX_EVT14.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT14.
*/
#define	MINIMCDS_MCXEVT14	(MINIMCDS_MCX_EVT14)

/** \\brief  83C, Event Definition Register */
#define MINIMCDS_MCX_EVT15 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_EVT*)0xF910083Cu)

