HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxMinimcds_reg.h
/** Alias (User Manual Name) for MINIMCDS_MCX_EVT15.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT15.
*/
#define	MINIMCDS_MCXEVT15	(MINIMCDS_MCX_EVT15)

/** \\brief  808, Event Definition Register */
#define MINIMCDS_MCX_EVT2 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_EVT*)0xF9100808u)

/** Alias (User Manual Name) for MINIMCDS_MCX_EVT2.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT2.
*/
#define	MINIMCDS_MCXEVT2	(MINIMCDS_MCX_EVT2)

/** \\brief  80C, Event Definition Register */
#define MINIMCDS_MCX_EVT3 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_EVT*)0xF910080Cu)

/** Alias (User Manual Name) for MINIMCDS_MCX_EVT3.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT3.
*/
#define	MINIMCDS_MCXEVT3	(MINIMCDS_MCX_EVT3)

/** \\brief  810, Event Definition Register */
#define MINIMCDS_MCX_EVT4 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_EVT*)0xF9100810u)

/** Alias (User Manual Name) for MINIMCDS_MCX_EVT4.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT4.
*/
#define	MINIMCDS_MCXEVT4	(MINIMCDS_MCX_EVT4)

/** \\brief  814, Event Definition Register */
#define MINIMCDS_MCX_EVT5 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_EVT*)0xF9100814u)

/** Alias (User Manual Name) for MINIMCDS_MCX_EVT5.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT5.
*/
#define	MINIMCDS_MCXEVT5	(MINIMCDS_MCX_EVT5)

/** \\brief  818, Event Definition Register */
#define MINIMCDS_MCX_EVT6 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_EVT*)0xF9100818u)

/** Alias (User Manual Name) for MINIMCDS_MCX_EVT6.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT6.
*/
#define	MINIMCDS_MCXEVT6	(MINIMCDS_MCX_EVT6)

/** \\brief  81C, Event Definition Register */
#define MINIMCDS_MCX_EVT7 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_EVT*)0xF910081Cu)

/** Alias (User Manual Name) for MINIMCDS_MCX_EVT7.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT7.
*/
#define	MINIMCDS_MCXEVT7	(MINIMCDS_MCX_EVT7)

/** \\brief  820, Event Definition Register */
#define MINIMCDS_MCX_EVT8 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_EVT*)0xF9100820u)

/** Alias (User Manual Name) for MINIMCDS_MCX_EVT8.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT8.
*/
#define	MINIMCDS_MCXEVT8	(MINIMCDS_MCX_EVT8)

/** \\brief  824, Event Definition Register */
#define MINIMCDS_MCX_EVT9 /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_EVT*)0xF9100824u)

/** Alias (User Manual Name) for MINIMCDS_MCX_EVT9.
* To use register names with standard convension, please use MINIMCDS_MCX_EVT9.
*/
#define	MINIMCDS_MCXEVT9	(MINIMCDS_MCX_EVT9)

/** \\brief  14, MCDS Signal Source Control */
#define MINIMCDS_MUX /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_MUX*)0xF9100014u)

/** \\brief  4, OCDS Control and Status */
#define MINIMCDS_OCS /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_OCS*)0xF9100004u)

/** \\brief  200C, Compact Function Trace Register */
#define MINIMCDS_TCX_CFT /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCX_CFT*)0xF910200Cu)

/** Alias (User Manual Name) for MINIMCDS_TCX_CFT.
* To use register names with standard convension, please use MINIMCDS_TCX_CFT.
*/
#define	MINIMCDS_TCXCFT	(MINIMCDS_TCX_CFT)

/** \\brief  2008, Current Instruction Pointer */
#define MINIMCDS_TCX_CIP /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCX_CIP*)0xF9102008u)

/** Alias (User Manual Name) for MINIMCDS_TCX_CIP.
* To use register names with standard convension, please use MINIMCDS_TCX_CIP.
*/
#define	MINIMCDS_TCXCIP	(MINIMCDS_TCX_CIP)

/** \\brief  2000, Debug Status Register */
#define MINIMCDS_TCX_DCSTS /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCX_DCSTS*)0xF9102000u)

/** Alias (User Manual Name) for MINIMCDS_TCX_DCSTS.
* To use register names with standard convension, please use MINIMCDS_TCX_DCSTS.
*/
#define	MINIMCDS_TCXDCSTS	(MINIMCDS_TCX_DCSTS)

/** \\brief  2400, Comparator Bound Register */
#define MINIMCDS_TCX_EA0_BND /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCXEA_BND*)0xF9102400u)

/** Alias (User Manual Name) for MINIMCDS_TCX_EA0_BND.
* To use register names with standard convension, please use MINIMCDS_TCX_EA0_BND.
*/
#define	MINIMCDS_TCXEABND0	(MINIMCDS_TCX_EA0_BND)

/** \\brief  2404, Comparator Range Register */
#define MINIMCDS_TCX_EA0_RNG /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCXEA_RNG*)0xF9102404u)

/** Alias (User Manual Name) for MINIMCDS_TCX_EA0_RNG.
* To use register names with standard convension, please use MINIMCDS_TCX_EA0_RNG.
*/
#define	MINIMCDS_TCXEARNG0	(MINIMCDS_TCX_EA0_RNG)

/** \\brief  2410, Comparator Bound Register */
#define MINIMCDS_TCX_EA1_BND /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCXEA_BND*)0xF9102410u)

/** Alias (User Manual Name) for MINIMCDS_TCX_EA1_BND.
* To use register names with standard convension, please use MINIMCDS_TCX_EA1_BND.
*/
#define	MINIMCDS_TCXEABND1	(MINIMCDS_TCX_EA1_BND)

/** \\brief  2414, Comparator Range Register */
#define MINIMCDS_TCX_EA1_RNG /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCXEA_RNG*)0xF9102414u)

/** Alias (User Manual Name) for MINIMCDS_TCX_EA1_RNG.
* To use register names with standard convension, please use MINIMCDS_TCX_EA1_RNG.
*/
#define	MINIMCDS_TCXEARNG1	(MINIMCDS_TCX_EA1_RNG)

/** \\brief  3000, Comparator Bound Register */
#define MINIMCDS_TCX_IP0_BND /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCXIP_BND*)0xF9103000u)

/** Alias (User Manual Name) for MINIMCDS_TCX_IP0_BND.
* To use register names with standard convension, please use MINIMCDS_TCX_IP0_BND.
*/
#define	MINIMCDS_TCXIPBND0	(MINIMCDS_TCX_IP0_BND)

/** \\brief  3004, Comparator Range Register */
#define MINIMCDS_TCX_IP0_RNG /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCXIP_RNG*)0xF9103004u)

/** Alias (User Manual Name) for MINIMCDS_TCX_IP0_RNG.
* To use register names with standard convension, please use MINIMCDS_TCX_IP0_RNG.
*/
#define	MINIMCDS_TCXIPRNG0	(MINIMCDS_TCX_IP0_RNG)

/** \\brief  3010, Comparator Bound Register */
#define MINIMCDS_TCX_IP1_BND /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCXIP_BND*)0xF9103010u)

/** Alias (User Manual Name) for MINIMCDS_TCX_IP1_BND.
* To use register names with standard convension, please use MINIMCDS_TCX_IP1_BND.
*/
#define	MINIMCDS_TCXIPBND1	(MINIMCDS_TCX_IP1_BND)

/** \\brief  3014, Comparator Range Register */
#define MINIMCDS_TCX_IP1_RNG /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCXIP_RNG*)0xF9103014u)

/** Alias (User Manual Name) for MINIMCDS_TCX_IP1_RNG.
* To use register names with standard convension, please use MINIMCDS_TCX_IP1_RNG.
*/
#define	MINIMCDS_TCXIPRNG1	(MINIMCDS_TCX_IP1_RNG)

/** \\brief  2480, Comparator Bound Register */
#define MINIMCDS_TCX_WD0_BND /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCXWD_BND*)0xF9102480u)

/** Alias (User Manual Name) for MINIMCDS_TCX_WD0_BND.
* To use register names with standard convension, please use MINIMCDS_TCX_WD0_BND.
*/
#define	MINIMCDS_TCXWDBND0	(MINIMCDS_TCX_WD0_BND)

