HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxMinimcds_reg.h
/** \\brief  2490, Comparator Mask Register */
#define MINIMCDS_TCX_WD0_MSK /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCXWD_MSK*)0xF9102490u)

/** Alias (User Manual Name) for MINIMCDS_TCX_WD0_MSK.
* To use register names with standard convension, please use MINIMCDS_TCX_WD0_MSK.
*/
#define	MINIMCDS_TCXWDMSK0	(MINIMCDS_TCX_WD0_MSK)

/** \\brief  2488, Comparator Range Register */
#define MINIMCDS_TCX_WD0_RNG /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCXWD_RNG*)0xF9102488u)

/** Alias (User Manual Name) for MINIMCDS_TCX_WD0_RNG.
* To use register names with standard convension, please use MINIMCDS_TCX_WD0_RNG.
*/
#define	MINIMCDS_TCXWDRNG0	(MINIMCDS_TCX_WD0_RNG)

/** \\brief  249C, Comparator Sign Register */
#define MINIMCDS_TCX_WD0_SGN /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCXWD_SGN*)0xF910249Cu)

/** Alias (User Manual Name) for MINIMCDS_TCX_WD0_SGN.
* To use register names with standard convension, please use MINIMCDS_TCX_WD0_SGN.
*/
#define	MINIMCDS_TCXWDSGN0	(MINIMCDS_TCX_WD0_SGN)

/** \\brief  24A0, Comparator Bound Register */
#define MINIMCDS_TCX_WD1_BND /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCXWD_BND*)0xF91024A0u)

/** Alias (User Manual Name) for MINIMCDS_TCX_WD1_BND.
* To use register names with standard convension, please use MINIMCDS_TCX_WD1_BND.
*/
#define	MINIMCDS_TCXWDBND1	(MINIMCDS_TCX_WD1_BND)

/** \\brief  24B0, Comparator Mask Register */
#define MINIMCDS_TCX_WD1_MSK /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCXWD_MSK*)0xF91024B0u)

/** Alias (User Manual Name) for MINIMCDS_TCX_WD1_MSK.
* To use register names with standard convension, please use MINIMCDS_TCX_WD1_MSK.
*/
#define	MINIMCDS_TCXWDMSK1	(MINIMCDS_TCX_WD1_MSK)

/** \\brief  24A8, Comparator Range Register */
#define MINIMCDS_TCX_WD1_RNG /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCXWD_RNG*)0xF91024A8u)

/** Alias (User Manual Name) for MINIMCDS_TCX_WD1_RNG.
* To use register names with standard convension, please use MINIMCDS_TCX_WD1_RNG.
*/
#define	MINIMCDS_TCXWDRNG1	(MINIMCDS_TCX_WD1_RNG)

/** \\brief  24BC, Comparator Sign Register */
#define MINIMCDS_TCX_WD1_SGN /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TCXWD_SGN*)0xF91024BCu)

/** Alias (User Manual Name) for MINIMCDS_TCX_WD1_SGN.
* To use register names with standard convension, please use MINIMCDS_TCX_WD1_SGN.
*/
#define	MINIMCDS_TCXWDSGN1	(MINIMCDS_TCX_WD1_SGN)

/** \\brief  408, Clock Counter Register */
#define MINIMCDS_TSUEMUCNT /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TSUEMUCNT*)0xF9100408u)

/** \\brief  404, Clock Prescaler Register */
#define MINIMCDS_TSUPRSCL /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TSUPRSCL*)0xF9100404u)

/** \\brief  400, Clock Counter Register */
#define MINIMCDS_TSUREFCNT /*lint --e(923)*/ (*(volatile Ifx_MINIMCDS_TSUREFCNT*)0xF9100400u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXMINIMCDS_REG_H */
